twitter-clone/app/controllers/home_controller.rb

  def index
     @twits = current_user.all_twits
     @last_twit = current_user.twits.last
---
SELECT * FROM "twits" WHERE ("twits".user_id = 21) ORDER BY twits.id DESC LIMIT 1

  def show
     @user = User.find_by_username(params[:username])
---
SELECT * FROM "users" WHERE ("users"."username" = 'ruslan') LIMIT 1

  def toggle_follow
     @user = User.find_by_username(params[:username])
---
SELECT * FROM "users" WHERE ("users"."username" = 'magnus_pfeffer') LIMIT 1

  def toggle_follow_via_ajax
     user = User.find_by_username(params[:username])
---
SELECT * FROM "users" WHERE ("users"."username" = 'magnus_pfeffer') LIMIT 1

  def remove_friend
    friend = User.find_by_username(params[:username])
---
SELECT * FROM "users" WHERE ("users"."username" = 'magnus_pfeffer') LIMIT 1