twitter-clone/app/controllers/twits_controller.rb

    def create
	twit = current_user.twits.build(params[:twit])
	twit.message = twit.message[0..138]
	twit.created_at = Time.now
---
INSERT INTO "twits" ("created_at", "user_id", "message") VALUES('2010-07-16 01:00:30', 21, 'Tell us what you’re doing in the box above